heatfluxtimevary/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 293;

boundaryField
{
    frontAndBack
    {
        type            zeroGradient;
    }

    topAndBottom
    {
        type            zeroGradient;
    }

    hot
    {
        type            uniformFixedGradient;
        uniformGradient
        {
            type            csvFile;
            nHeaderLine     1;
            refColumn       0;
            componentColumns ( 1 );
            separator       ",";
            mergeSeparators no;
            file            "<constant>/temp_profile.csv";
        }
    }

    cold
    {
        type            fixedValue;
        value           uniform 300.0;
    }
}


// ************************************************************************* //
